Rainchus/marioparty4/src/REL/m408Dll/main.c
#include "game/object.h"
#include "game/objsub.h"
#include "game/wipe.h"
#include "game/chrman.h"
#include "game/minigame_seq.h"
#include "game/pad.h"

#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/sprite.h"

#include "game/audio.h"
#include "game/gamework_data.h"

#include "REL/m408Dll.h"

#include "math.h"
#include "ext_math.h"

#include "rel_sqrt_consts.h"

s32 lbl_1_data_0[] = {
	0x610000,
	0x610001,
	0x610002,
	0x610003,
	0x610004,
	0x610005,
	0x610006,
	0x610007
};

Vec lbl_1_data_20 = { 150, 1250, 150 };
Vec lbl_1_data_2C = { -0.1, -0.8, 0.1 };
GXColor lbl_1_data_38 = { 255, 255, 255, 255 };
Vec lbl_1_data_3C[] = {
	{ 0, -2000, 0 },
	{ 0, 1, 0}
};
GXColor lbl_1_data_54 = { 255, 255, 255, 255 };
Vec lbl_1_data_58 = { 50, 15000, 50 };
Vec lbl_1_data_64 = { 0, 1, 0 };
Vec lbl_1_data_70 = { 0, 0, 0 };

omObjData *lbl_1_bss_78;
omObjData *lbl_1_bss_74;
omObjData *lbl_1_bss_70;
omObjData **lbl_1_bss_6C;
omObjData *lbl_1_bss_68;
s16 lbl_1_bss_66;
s16 lbl_1_bss_64;
u16 lbl_1_bss_62;
u16 lbl_1_bss_60;
s32 lbl_1_bss_5C;
s32 lbl_1_bss_58;
float lbl_1_bss_54;
float lbl_1_bss_50;
u32 lbl_1_bss_4C;
s32 lbl_1_bss_48;
s32 lbl_1_bss_44;
s32 lbl_1_bss_40;
u32 lbl_1_bss_3C;
s32 lbl_1_bss_28[5];
s32 lbl_1_bss_24;
s32 lbl_1_bss_20;
s32 lbl_1_bss_1C;
s32 lbl_1_bss_18;
s32 lbl_1_bss_14;
s32 lbl_1_bss_10;
s32 lbl_1_bss_C;
omObjData *lbl_1_bss_8;
float lbl_1_bss_4;
s32 lbl_1_bss_0;

void fn_1_51C(omObjData *object);
void fn_1_9F0(omObjData *object);

void fn_1_25D4(Process *objman);

void ObjectSetup(void)
{
	s32 temp_r31;
	Process *temp_r30;
	s16 temp_r29;
	LightData *temp_r28;
	Vec sp14 = { 0, 0, 0 };
	Vec sp8 = { 0, 0, -1 };
	HuAudSndGrpSet(33);
	HuAudFXListnerSetEX(&sp14, &sp8, 6000, 3656.6667f, 0, 300, 300);
	lbl_1_bss_1C = lbl_1_bss_18 = lbl_1_bss_14 = lbl_1_bss_10 = -1;
	lbl_1_bss_C = 0;
	lbl_1_bss_44 = 1;
	lbl_1_bss_40 = 0;
	temp_r29 = Hu3DGLightCreateV(&lbl_1_data_20, &lbl_1_data_2C, &lbl_1_data_38);
	Hu3DGLightInfinitytSet(temp_r29);
	temp_r28 = &Hu3DGlobalLight[temp_r29];
	temp_r28->unk_00 |= 0x8000;
	Hu3DShadowCreate(30, 100, 25000);
	Hu3DShadowTPLvlSet(0.3f);
	Hu3DShadowPosSet(&lbl_1_data_58, &lbl_1_data_64, &lbl_1_data_70);
	temp_r30 = omInitObjMan(50, 8192);
	omGameSysInit(temp_r30);
	for(temp_r31=0; temp_r31<4; temp_r31++) {
		CRotM[temp_r31].x = 324.3f;
		CRotM[temp_r31].y = 0;
		CRotM[temp_r31].z = 0;
		CenterM[temp_r31].x = 0;
		CenterM[temp_r31].y = 130;
		CenterM[temp_r31].z = 224;
		CZoomM[temp_r31] = 220;
	}
	Hu3DCameraCreate(1);
	Hu3DCameraPerspectiveSet(1, -1, 5, 25000, (4.0f/3.0f));
	Hu3DCameraViewportSet(1, 0, 0, 640, 480, 0, 1);
	lbl_1_bss_70 = omAddObjEx(temp_r30, 32730, 0, 0, -1, omOutView);
	lbl_1_bss_62 = 0;
	lbl_1_bss_60 = 0;
	lbl_1_bss_48 = 0;
	lbl_1_bss_78 = omAddObjEx(temp_r30, 10, 0, 0, -1, fn_1_51C);
	lbl_1_bss_3C = 0;
	for(temp_r31=0; temp_r31<5; temp_r31++) {
		lbl_1_bss_28[temp_r31] = -1;
	}
	lbl_1_bss_74 = omAddObjEx(temp_r30, 50, 0, 0, -1, fn_1_9F0);
	fn_1_25D4(temp_r30);
	fn_1_C44C(temp_r30);
	fn_1_118D0(temp_r30);
	fn_1_8958(temp_r30);
}

void fn_1_56C(omObjData *object);
void fn_1_9A4(omObjData *object);

void fn_1_51C(omObjData *object)
{
	lbl_1_bss_66 = 30;
	lbl_1_bss_64 = 60;
	lbl_1_bss_4C = 4;
	lbl_1_bss_62 = 0;
	object->func = fn_1_56C;
}


void fn_1_56C(omObjData *object)
{
	s32 temp_r30 = 0;
	Vec sp14;
	Vec sp8;
	switch(lbl_1_bss_62) {
		case 0:
			WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 60);
			lbl_1_bss_44 = 0;
			Hu3DCameraPerspectiveSet(1, 50, 5, 25000, (4.0f/3.0f));
			lbl_1_bss_62 = 1;
			break;
			
		case 1:
			if(fn_1_C43C() == 5) {
				lbl_1_bss_62 = 2;
			}
			break;
			
		case 2:
			if(fn_1_6878() == 5) {
				object->work[0] = 0;
				lbl_1_bss_62 = 3;
			}
			break;
			
		case 3:
			if(lbl_1_bss_4C == 0 || WipeStatGet() == 0) {
				if(++object->work[0] >= 210.0f) {
					lbl_1_bss_62 = 4;
				}
			}
			break;
			
		case 4:
			lbl_1_bss_62 = 5;
			break;
			
		case 5:
			if(fn_1_C43C() == 5) {
				temp_r30 = 1;
				lbl_1_bss_62 = 5;
			}
			break;
	}
	sp8.x = -(sind(CRot.y)*cosd(CRot.x));
	sp8.y = -(-sind(CRot.x));
	sp8.z = -(cosd(CRot.y)*cosd(CRot.x));
	sp14.x = Center.x-(sp8.x*CZoom);
	sp14.y = Center.y-(sp8.y*CZoom);
	sp14.z = Center.z-(sp8.z*CZoom);
	HuAudFXListnerUpdate(&sp14, &sp8);
	if((omSysExitReq && !WipeStatGet()) && !lbl_1_bss_44 || temp_r30) {
		WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
		lbl_1_bss_44 = 1;
		lbl_1_bss_40 = 1;
		if(lbl_1_bss_10 >= 0) {
			HuAudFXFadeOut(lbl_1_bss_10, 30);
		}
		object->func = fn_1_9A4;
	}
}

void fn_1_9A4(omObjData *object)
{
	if(!WipeStatGet()) {
		CharModelKill(-1);
		MGSeqKillAll();
		HuAudFadeOut(1);
		omOvlReturnEx(1, 1);
	}
}

void fn_1_A40(omObjData *object);

void fn_1_9F0(omObjData *object)
{
	lbl_1_bss_54 = 12000;
	lbl_1_bss_50 = 0;
	lbl_1_bss_60 = 0;
	object->func = fn_1_A40;
}

void fn_1_CD8(omObjData *object);

u32 fn_1_6868(void);

void fn_1_A40(omObjData *object)
{
	if(fn_1_6868() != 2) {
		return;
	}
	switch(lbl_1_bss_60) {
		case 0:
			Hu3DCameraPerspectiveSet(1, 35, 5, 25000, (4.0f/3.0f));
			CRot.x = -80.5f;
			CRot.y = CRot.z = 0;
			Center.x = 0;
			Center.y = lbl_1_bss_54;
			Center.z = 0;
			CZoom = 260;
			lbl_1_bss_60 = 1;
			break;
			
		case 1:
			lbl_1_bss_24 = MGSeqStartCreate();
			MGSeqPosSet(lbl_1_bss_24, 320, 240);
			lbl_1_bss_60 = 2;

			
		case 2:
			Center.y = lbl_1_bss_54;
			lbl_1_bss_50 = -400.0f;;
			lbl_1_bss_54 += lbl_1_bss_50*(1.0f/60.0f);
			if(lbl_1_bss_1C < 0 && (MGSeqStatGet(lbl_1_bss_24) & 0x10)) {
				lbl_1_bss_1C = HuAudSeqPlay(74);
			}
			if(MGSeqStatGet(lbl_1_bss_24) == 0) {
				lbl_1_bss_60 = 3;
				object->func = fn_1_CD8;
			}
			
			break;
	}
}

void fn_1_8020(void);

void fn_1_EF8(omObjData *object);

void fn_1_12A0(omObjData *object);

void fn_1_CD8(omObjData *object)
{
	Center.y = lbl_1_bss_54;
	lbl_1_bss_50 = -400.0f;
	lbl_1_bss_54 += lbl_1_bss_50*(1.0f/60.0f);
	fn_1_8020();
	if(lbl_1_bss_4C == 0) {
		lbl_1_bss_48 = 1;
		lbl_1_bss_20 = MGSeqFinishCreate();
		MGSeqPosSet(lbl_1_bss_20, 320, 240);
		HuAudSeqFadeOut(lbl_1_bss_1C, 100);
		object->func = fn_1_12A0;
	} else {
		if(lbl_1_bss_54 <= (-lbl_1_bss_50*0.5f)) {
			lbl_1_bss_20 = MGSeqFinishCreate();
			MGSeqPosSet(lbl_1_bss_20, 320, 240);
			HuAudSeqFadeOut(lbl_1_bss_1C, 100);
			lbl_1_bss_50 = -120.00001f;
			lbl_1_bss_54 = -lbl_1_bss_50*2.0f;
			lbl_1_bss_60 = 4;
			object->func = fn_1_EF8;
			
