Rainchus/marioparty4/src/REL/m408Dll/main.c
}

s32 lbl_1_data_C8[] = {
	0x270002,
	0x270003,
	0x270004,
	0x270005,
	0x270006,
	0x270007,
	0x270008,
	0x270009,
};

u32 lbl_1_data_E8[] = {
	0,
	23,
	24,
	0x27002C,
	0x27003C,
	0x270034,
	22
};

float lbl_1_data_104[][2] = {
	-40, -30,
	40, -30,
	-40, 30,
	40, 30
};

float lbl_1_data_124[][2] = {
	0, -56,
	0, 56,
	-80, 0,
	80, 0
};

void fn_1_2FAC(omObjData *object);
void fn_1_5AB4(ModelData *model, ParticleData *particle, Mtx matrix);

void fn_1_26E4(omObjData *object)
{
	Work2FAC *temp_r31;
	s32 temp_r28;
	s32 temp_r27;
	
	float sp20[4] = { 0.25, 0.5, 0.75, 1.0 };
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work2FAC), MEMORY_DEFAULT_NUM);
	temp_r31 = object->data;
	memset(temp_r31, 0, sizeof(Work2FAC));
	temp_r31->unk0 = object->work[0];
	temp_r31->unk2 = GWPlayerCfg[temp_r31->unk0].character;
	temp_r31->unk2 &= 0x7;
	temp_r31->unk4 = 0;
	temp_r31->unk90 = sp20[GWPlayerCfg[object->work[0]].diff & 0x3];
	temp_r31->unk1C.x = lbl_1_data_104[temp_r31->unk0][0];
	temp_r31->unk1C.y = lbl_1_bss_54;
	temp_r31->unk1C.z = lbl_1_data_104[temp_r31->unk0][1];
	temp_r31->unk28.x = temp_r31->unk28.y = temp_r31->unk28.z = 0;
	temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
	temp_r31->unk58.y = 0;
	temp_r31->unk58.x = 0;
	temp_r31->unk4C.x = temp_r31->unk4C.y = temp_r31->unk4C.z = 0;
	temp_r31->unk58.z = 9.0f;
	temp_r31->unk40.x = temp_r31->unk40.y = temp_r31->unk40.z = 0;
	temp_r31->unk8 = 4;
	temp_r31->unkC = 0;
	fn_1_1940(temp_r31, &temp_r31->unk68);
	omSetTra(object, temp_r31->unk1C.x+temp_r31->unk68.x, temp_r31->unk1C.y+temp_r31->unk68.y, temp_r31->unk1C.z+temp_r31->unk68.z);
	omSetSca(object, 0.075f, 0.075f, 0.075f);
	object->model[0] = CharModelCreate(temp_r31->unk2, 4);
	for(temp_r28=0; temp_r28<7; temp_r28++) {
		if(lbl_1_data_E8[temp_r28] < 0x10000) {
			object->motion[temp_r28] = CharModelMotionCreate(temp_r31->unk2, lbl_1_data_E8[temp_r28]);
		} else {
			object->motion[temp_r28] = Hu3DJointMotionFile(object->model[0], temp_r31->unk2+lbl_1_data_E8[temp_r28]);
		}
	}
	CharModelVoiceEnableSet(temp_r31->unk2, object->motion[1], 0);
	CharModelMotionShiftSet(temp_r31->unk2, object->motion[0], 0, 0.2, 0x40000001);
	CharModelLayerSetAll(2);
	CharModelMotionDataClose(temp_r31->unk2);
	object->model[1] = Hu3DModelCreateFile(lbl_1_data_C8[temp_r31->unk2]);
	Hu3DModelLayerSet(object->model[1], 6);
	Hu3DModelScaleSet(object->model[1], 0.1f*temp_r31->unk8, 0.1f*temp_r31->unk8, 0.1f*temp_r31->unk8);
	Hu3DModelAttrSet(object->model[1], 1);
	temp_r31->unk94.x = temp_r31->unk94.y = temp_r31->unk94.z = 0;
	temp_r31->unkA0.x = temp_r31->unkA0.y = temp_r31->unkA0.z = 0;
	fn_1_1BE8(object, 1.0f);
	temp_r27 = Hu3DParticleCreate(HuSprAnimReadFile(0x270024), 256);
	object->model[2] = temp_r27;
	Hu3DModelLayerSet(temp_r27, 6);
	Hu3DParticleColSet(temp_r27, 255, 255, 255);
	Hu3DParticleHookSet(temp_r27, fn_1_5AB4);
	Hu3DModelPosSet(temp_r27, 0, 0, 0);
	((ParticleData *)Hu3DData[temp_r27].unk_120)->unk_00 = 0;
	temp_r31->unk74 = temp_r31->unk78 = 0;
	temp_r31->unk7C[0] = temp_r31->unk7C[1] = 0;
	temp_r31->unk8C = -1;
	temp_r31->unk8E = 0;
	temp_r31->unk84[0] = temp_r31->unk84[1] = 0;
	object->work[1] = 0;
	object->func = fn_1_2FAC;
}

void fn_1_5DCC(s32 arg0, Vec *arg1, u32 arg2);
void fn_1_3E80(omObjData *object);

void fn_1_2FAC(omObjData *object)
{
	Work2FAC *temp_r31 = object->data;
	Vec sp78[] = {
		{ 8, -25, -18 },
		{ 2, -25, -10 },
		{ 2, -25, -24 },
		{ -3, -25, -15}
	};
	Vec sp3C;
	Vec sp30;
	Vec sp24;
	float sp14[] = {
		45,
		135,
		225,
		315
	};
	float temp_f27;
	switch(object->work[1]) {
		case 0:
			fn_1_C3C0(&sp3C, &sp30);
			fn_1_1A60(&sp3C, &sp30, &sp78[temp_r31->unk0], &sp24);
			omSetRot(object, 0, 90, 0);
			omSetTra(object, sp24.x, sp24.y, sp24.z);
			if(fn_1_C43C() != 1) {
				object->work[1]++;
				temp_r31->unk58.y = 60;
				temp_r31->unk58.x = sp14[temp_r31->unk0];
				temp_r31->unk28.x = temp_r31->unk28.y = temp_r31->unk28.z = 0;
				object->trans.x -= 10.0*(2.0*sind(temp_r31->unk58.x));
				object->trans.z -= 10.0*(2.0*cosd(temp_r31->unk58.x));
				CharModelMotionShiftSet(temp_r31->unk2, object->motion[4], 0, 0.2, 0x40000001);
				temp_r31->unk1C.x = temp_r31->unk94.x = object->trans.x;
				temp_r31->unk1C.y = temp_r31->unk94.y = object->trans.y;
				temp_r31->unk1C.z = temp_r31->unk94.z = object->trans.z;
			}
			break;
			
		case 1:
			temp_r31->unk28.y += -98.0f;
			if(temp_r31->unk28.y < -400.0f) {
				temp_r31->unk28.y = -400.0f;
			}
			temp_f27 = object->trans.y;
			object->trans.y += temp_r31->unk28.y*(1.0f/60.0f);
			temp_r31->unk58.x += 1.5000001f;
			if(temp_r31->unk58.x >= 360.0f) {
				temp_r31->unk58.x -= 360.0f;
			}
			object->trans.x += (3.141590118408203f*(10.0*sind(temp_r31->unk58.x-90.0f)))*(1.0f/60.0f);
			object->trans.z += (3.141590118408203f*(10.0*cosd(temp_r31->unk58.x-90.0f)))*(1.0f/60.0f);
			if(temp_f27 > 12000 && object->trans.y <= 12000){
				sp3C.x = object->trans.x;
				sp3C.y = object->trans.y;
				sp3C.z = object->trans.z;
				fn_1_5DCC(object->model[2], &sp3C, 100);
			}
			temp_r31->unk4C.x = temp_r31->unk58.y;
			temp_r31->unk4C.y = temp_r31->unk58.x;
			temp_r31->unk4C.z = 0;
			temp_r31->unk1C.x = object->trans.x;
			temp_r31->unk1C.y = object->trans.y;
			temp_r31->unk1C.z = object->trans.z;
			omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
			Hu3DModelAttrReset(object->model[1], 0x1);
			temp_r31->unkC += 0.2f*(1.0f-temp_r31->unkC);
			if(object->trans.y < 11940) {
				object->work[1]++;
			}
			break;
	}
	fn_1_1BE8(object, 1.0f);
	if(fn_1_6878() == 1) {
		omSetSca(object, 0.15f, 0.15f, 0.15f);
		object->trans.x = temp_r31->unk1C.x = temp_r31->unk94.x = lbl_1_data_104[temp_r31->unk0][0];
		object->trans.y = temp_r31->unk1C.y = temp_r31->unk94.y = lbl_1_bss_54;
		object->trans.z = temp_r31->unk1C.z = temp_r31->unk94.z = lbl_1_data_104[temp_r31->unk0][1];
		object->rot.y = temp_r31->unk58.x = atan2d(object->trans.x, object->trans.z)+180.0;
		Hu3DModelAttrReset(object->model[1], 1);
		((ParticleData *)Hu3DData[object->model[2]].unk_120)->unk_00 = 0;
		object->func = fn_1_3E80;
	}
}

