Rainchus/marioparty4/src/REL/m408Dll/main.c
void fn_1_38D0(omObjData *arg0, s8 *arg1, s8 *arg2)
{
	float temp_f31;
	float temp_f30;
	float temp_f29;
	Work2FAC *temp_r31;
	Work2FAC *temp_r30;
	s8 temp_r29;
	s32 temp_r28;
	s32 temp_r25;
	Vec sp18;
	Vec spC;
	s8 sp8[4];

	temp_r31 = arg0->data;
	*arg1 = temp_r31->unk7C[0];
	*arg2 = temp_r31->unk7C[1];
	sp18.x = temp_r31->unk1C.x;
	sp18.y = temp_r31->unk1C.y;
	sp18.z = temp_r31->unk1C.z;
	temp_r25 = fn_1_162CC(&sp18, &spC);
	temp_r29 = 0;
	sp8[0] = -1;
	for(temp_r28=0; temp_r28<4; temp_r28++) {
		if(temp_r28 != temp_r31->unk0) {
			temp_r30 = fn_1_68A8(temp_r28);
			if((temp_r30->unk4 & 0x12) == 0) {
				sp8[temp_r29++] = temp_r28;
			}
		}
	}
	switch(temp_r31->unk8E) {
		case 0:
			if(temp_r29 > 0 || temp_r25) {
				if(temp_r29 > 0) {
					temp_r31->unk8C = sp8[frandmod(temp_r29)];
				}
				temp_r31->unk74 = frandmod(180)+120.0f;
				temp_r31->unk78 = 0;
				temp_r31->unk8E = 1;
			} else {
				temp_r31->unk78 = 0;
				temp_r31->unk8E = 2;
			}
			break;
			
		case 1:
			if((temp_r31->unk78 & 0x3) == 0) {
				if(temp_r25) {
					temp_f31 = atan2d(spC.x-temp_r31->unk1C.x, spC.z-temp_r31->unk1C.z);
				} else {
					temp_r30 = fn_1_68A8(temp_r31->unk8C);
					temp_f31 = atan2d(temp_r30->unk1C.x-temp_r31->unk1C.x, temp_r30->unk1C.z-temp_r31->unk1C.z);
				}
				temp_r31->unk84[1] = fn_1_883C(temp_r31->unk84[0], temp_f31, (0.3f*temp_r31->unk90)+0.15f);
			}
			temp_r31->unk78++;
			temp_r31->unk84[0] = fn_1_883C(temp_r31->unk84[0], temp_r31->unk84[1], 0.2f);
			temp_r31->unk7C[0] = sind(temp_r31->unk84[0])*80.0;
			temp_r31->unk7C[1] = -cosd(temp_r31->unk84[0])*80.0;
			*arg1 = temp_r31->unk7C[0];
			*arg2 = temp_r31->unk7C[1];
			temp_r31->unk74--;
			if(temp_r25 == 0 && (temp_r30->unk4 & 0x12)) {
				temp_r31->unk74 = 0;
			}
			if(temp_r31->unk74 == 0) {
				temp_r31->unk8E = 0;
			}
			break;
			
		case 2:
			if((temp_r31->unk78 & 0xF) == 0) {
				temp_f30 = (0.04f*frandmod(1000))-20.0f;
				temp_f29 = (0.04f*frandmod(1000))-20.0f;
				temp_r31->unk84[1] = temp_f31 = atan2d(temp_f30-temp_r31->unk1C.x, temp_f29-temp_r31->unk1C.z);
			}
			temp_r31->unk78++;
			temp_r31->unk84[0] = fn_1_883C(temp_r31->unk84[0], temp_r31->unk84[1], 0.2f);
			temp_r31->unk7C[0] = sind(temp_r31->unk84[0])*80.0;
			temp_r31->unk7C[1] = -cosd(temp_r31->unk84[0])*80.0;
			*arg1 = temp_r31->unk7C[0];
			*arg2 = temp_r31->unk7C[1];
			if(temp_r29 > 0 || temp_r25) {
				temp_r31->unk8E = 0;
			}
			break;
	}

}

#define CHECK_IDLE(pos) (((pos) < 0) ? -(pos) : ((pos)>15))

void fn_1_4A58(omObjData *object);
void fn_1_5098(omObjData *object);
void fn_1_5684(omObjData *object);

void fn_1_3E80(omObjData *object)
{
	Work2FAC *temp_r31;
	s32 temp_r27;

	float temp_f29;
	float temp_f28;
	float temp_f22;
	float temp_f21;
	float temp_f20;
	s8 sp9;
	s8 sp8;
	
	temp_r31 = object->data;
	temp_r27 = GWPlayerCfg[temp_r31->unk0].pad_idx;
	sp9 = sp8 = 0;
	if(lbl_1_bss_60 == 3) {
		if(!GWPlayerCfg[temp_r31->unk0].iscom) {
			sp9 = HuPadStkX[temp_r27];
			sp8 = HuPadStkY[temp_r27];
		} else {
			fn_1_38D0(object, &sp9, &sp8);
		}
	}
	temp_r31->unk1C.y = lbl_1_bss_54;
	temp_f21 = temp_f20 = 0;
	temp_f28 = temp_r31->unk58.x;
	temp_f22 = -20;
	if(CHECK_IDLE(sp9) || CHECK_IDLE(sp8)) {
		temp_f28 = atan2d(sp9, -sp8);
		if(temp_f28 < 0) {
			temp_f28 += 360;
		}
		temp_f21 = 70*sind(temp_f28);
		temp_f20 = 70*cosd(temp_f28);
		temp_f22 = 30;
	}
	fn_1_1EBC(object);
	temp_r31->unk28.x = ((28.0f/30.0f)*temp_r31->unk28.x)+((2.0f/30.0f)*temp_f21);
	temp_r31->unk28.z = ((28.0f/30.0f)*temp_r31->unk28.z)+((2.0f/30.0f)*temp_f20);
	temp_f29 = VECMagXZ(&temp_r31->unk28);
	if(temp_f29 > 200.0f) {
		temp_f29 = 200.0f/temp_f29;
		temp_r31->unk28.x *= temp_f29;
		temp_r31->unk28.z *= temp_f29;
	}
	temp_r31->unk34.x += (temp_r31->unk28.x*(1.0f/60.0f));
	temp_r31->unk34.y = 0;
	temp_r31->unk34.z += (temp_r31->unk28.z*(1.0f/60.0f));
	temp_r31->unk58.x = temp_f28;
	temp_r31->unk58.y = (0.9f*temp_r31->unk58.y)+(0.1f*temp_f22);
	temp_r31->unk4C.x = temp_r31->unk58.y;
	temp_r31->unk4C.y = fn_1_883C(temp_r31->unk4C.y, temp_r31->unk58.x, 0.2f);
	temp_r31->unk4C.z = 0;
	omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
	fn_1_1940(temp_r31, &temp_r31->unk68);
	omSetTra(object, temp_r31->unk1C.x+temp_r31->unk68.x, temp_r31->unk1C.y+temp_r31->unk68.y, temp_r31->unk1C.z+temp_r31->unk68.z);
	temp_r31->unkC += (1.0f-temp_r31->unkC)*0.2f;
	fn_1_1BE8(object, 0.3f);
	if(temp_r31->unk4 & 0x1) {
		temp_r31->unk8--;
		temp_r31->unk10 = 0;
		temp_r31->unk4 |= 2;
		temp_f29 = VECMagXZ(&temp_r31->unk40);
		if(temp_f29 > 0.0f) {
			temp_f29 = 150.0f/temp_f29;
		}
		temp_r31->unk28.x = temp_r31->unk40.x*temp_f29;
		temp_r31->unk28.z = temp_r31->unk40.z*temp_f29;
		temp_r31->unk34.x = temp_r31->unk28.x*(1.0f/60.0f);
		temp_r31->unk34.z = temp_r31->unk28.z*(1.0f/60.0f);
		CharModelMotionShiftSet(temp_r31->unk2, object->motion[5], 0, 0.2f, 0);
		HuAudFXPlay(1358);
		omVibrate(object->work[0], 12, 4, 2);
		if(temp_r31->unk8) {
			HuAudCharVoicePlay(temp_r31->unk2, 296);
			object->func = fn_1_4A58;
		} else {
			temp_r31->unk4 |= 0x30;
			lbl_1_bss_4C--;
			HuAudCharVoicePlay(temp_r31->unk2, 291);
			object->func = fn_1_5684;
		}
	}
	if(fn_1_6878() == 4 && (temp_r31->unk4 & 0x20) == 0) {
		CharModelMotionShiftSet(temp_r31->unk2, object->motion[3], 0, 0.2f, 0);
		Hu3DModelShadowSet(object->model[0]);
		object->work[1] = 0;
		object->func = fn_1_5098;
	}
}
#undef CHECK_IDLE

void fn_1_4A58(omObjData *object)
{
	Work2FAC *temp_r31;
	s32 temp_r28;
	s32 temp_r26;
	s32 sp8;
	temp_r31 = object->data;
	sp8 = temp_r31->unk0;
	temp_r31->unk4 |= 2;
	temp_r31->unk1C.y = lbl_1_bss_54;
	fn_1_1EBC(object);
	temp_r31->unk28.x = (29.0f/30.0f)*temp_r31->unk28.x;
	temp_r31->unk28.z = (29.0f/30.0f)*temp_r31->unk28.z;
	temp_r31->unk34.x += temp_r31->unk28.x*(1.0f/60.0f);
	temp_r31->unk34.y = 0;
	temp_r31->unk34.z += temp_r31->unk28.z*(1.0f/60.0f);
	
	temp_r31->unk58.x += 9.0f;
	if(temp_r31->unk58.x >= 360.0f) {
		temp_r31->unk58.x -= 360.0f;
	}
	temp_r31->unk58.y = 0.9f*temp_r31->unk58.y;
	temp_r31->unk4C.x = temp_r31->unk58.y;
	temp_r31->unk4C.y = temp_r31->unk58.x;
	temp_r31->unk4C.z = 0;
	omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
	fn_1_1940(temp_r31, &temp_r31->unk68);
	omSetTra(object, temp_r31->unk1C.x+temp_r31->unk68.x, temp_r31->unk1C.y+temp_r31->unk68.y, temp_r31->unk1C.z+temp_r31->unk68.z);
	fn_1_1BE8(object, 0.8f);
	temp_r26 = temp_r31->unk10 & 0x1;
	temp_r31->unk10++;
	if(fn_1_6878() == 4) {
		temp_r26 = 0;
		CharModelMotionShiftSet(temp_r31->unk2, object->motion[3], 0, 0.2f, 0);
		Hu3DModelShadowSet(object->model[0]);
		object->work[1] = 0;
		object->func = fn_1_5098;
	} else if(temp_r31->unk10 > 60) {
		temp_r26 = 0;
		temp_r31->unk4 &= ~0x3;
		CharModelMotionShiftSet(temp_r31->unk2, object->motion[4], 0, 0.2f, 0x40000001);
		object->func = fn_1_3E80;
	}
	if(temp_r26) {
		Hu3DModelAttrSet(object->model[0], 1);
		for(temp_r28=0; temp_r28<temp_r31->unk8; temp_r28++) {
			Hu3DModelAttrSet(object->model[1], 1);
		}
	} else {
		Hu3DModelAttrReset(object->model[0], 1);
		for(temp_r28=0; temp_r28<temp_r31->unk8; temp_r28++) {
			Hu3DModelAttrReset(object->model[1], 1);
		}
	}
}

Vec lbl_1_data_144[] = {
	{ -50, 0, 0 },
	{ -16, 0, 0 },
	{ 16, 0, 0 },
	{ 50, 0, 0 }
};

Vec lbl_1_data_174[] = {
	{ 0, 1500, 2500 },
	{ 1500, 0, 1 },
	{ 0, 0, 0 }
};

void fn_1_54E4(omObjData *object);

void fn_1_5098(omObjData *object)
{
	Work2FAC *temp_r29;
	s32 temp_r27;
	
