Rainchus/marioparty4/src/REL/m408Dll/main.c
	temp_r29 = object->data;
	object->trans.x = lbl_1_data_144[object->work[0]].x;
	object->trans.z = lbl_1_data_144[object->work[0]].z;
	if(object->work[1] == 0) {
		if(lbl_1_bss_3C < temp_r29->unk8) {
			lbl_1_bss_3C = temp_r29->unk8;
		}
	} else if(object->work[1] == 10 && lbl_1_bss_3C == temp_r29->unk8) {
		for(temp_r27=0; lbl_1_bss_28[temp_r27]>=0; temp_r27++);
		lbl_1_bss_28[temp_r27] = temp_r29->unk2;
	}
	object->work[1]++;
	temp_r29->unk1C.y = lbl_1_bss_54;
	temp_r29->unk58.y = 0;
	temp_r29->unk58.x = 0;
	object->rot.x = object->rot.y = object->rot.z = 0;
	object->trans.y = temp_r29->unk1C.y;
	temp_r29->unk1C.x = object->trans.x;
	temp_r29->unk1C.z = object->trans.z;
	temp_r29->unk1C.y += lbl_1_data_A0[temp_r29->unk2];
	if(object->trans.y < 0) {
		object->trans.y = 0;
	}
	fn_1_1BE8(object, 1.0f);
	if(fn_1_6878() == 5) {
		object->func = fn_1_54E4;
		if(temp_r29->unk14) {
			lbl_1_bss_C = 1;
		}
	}
}

void fn_1_54E4(omObjData *object)
{
	Work2FAC *temp_r30 = object->data;
	fn_1_1E54(object);
	if(!(temp_r30->unk4 & 0x8)) {
		temp_r30->unk4 |= 0x8;
		if(temp_r30->unk14 != 0) {
			CharModelMotionShiftSet(temp_r30->unk2, object->motion[1], 0, 0.2f, 0);
			HuAudCharVoicePlay(temp_r30->unk2, 290);
			GWPlayerCoinCollectAdd(object->work[0], temp_r30->unk14);
		} else {
			CharModelMotionShiftSet(temp_r30->unk2, object->motion[2], 0, 0.2f, 0);
		}
		object->work[1] = 0;
	} else if(object->work[1] == 0 && Hu3DMotionEndCheck(object->model[0])) {
		lbl_1_bss_4C--;
		object->work[1]++;
	}
}

void fn_1_5AA0(omObjData *object);

void fn_1_5684(omObjData *object)
{
	Work2FAC *temp_r31;
	s32 temp_r29;
	temp_r31 = object->data;
	if(fabs(object->trans.x) < 160.0 || fabs(object->trans.z) < 160.0) {
		temp_r31->unk1C.x += temp_r31->unk28.x*(1.0f/60.0f);
		temp_r31->unk1C.z += temp_r31->unk28.z*(1.0f/60.0f);
		temp_r31->unk58.x += 9.0f;
		if(temp_r31->unk58.x >= 360.0f) {
			temp_r31->unk58.x -= 360.0f;
		}
		temp_r31->unk58.y = 0.9f*temp_r31->unk58.y;
		temp_r31->unk4C.x = 90.0f+temp_r31->unk58.y;
		temp_r31->unk4C.y = temp_r31->unk58.x;
		temp_r31->unk4C.z = 0;
		omSetRot(object, temp_r31->unk4C.x, temp_r31->unk4C.y, temp_r31->unk4C.z);
		fn_1_1940(temp_r31, &temp_r31->unk68);
		omSetTra(object, temp_r31->unk1C.x+temp_r31->unk68.x, temp_r31->unk1C.y+temp_r31->unk68.y, temp_r31->unk1C.z+temp_r31->unk68.z);
	}
	if(fn_1_6878() >= 4) {
		GWPlayerCoinCollectAdd(object->work[0], temp_r31->unk14);
		if(lbl_1_bss_48) {
			Hu3DModelAttrReset(object->model[0], 1);
			CharModelMotionSet(temp_r31->unk2, object->motion[6]);
			Hu3DModelAttrSet(object->model[0], 0x40000001);
			object->trans.x = lbl_1_data_144[object->work[0]].x;
			object->trans.y = 0;
			object->trans.z = lbl_1_data_144[object->work[0]].z;
			object->rot.x = object->rot.y = object->rot.z = 0;
		} else {
			Hu3DModelAttrSet(object->model[0], 1);
		}
		
		for(temp_r29=0; temp_r29<4; temp_r29++) {
			Hu3DModelAttrSet(object->model[1], 1);
		}
		object->func = fn_1_5AA0;
	}
}

void fn_1_5AA0(omObjData *object)
{
	Work2FAC *sp8 = object->data;
}

void fn_1_5AB4(ModelData *model, ParticleData *particle, Mtx matrix)
{
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	float temp_f31;
	if(particle->unk_00 == 0) {
		particle->unk_00++;
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk00 = 0;
			temp_r31->unk2C = 0;
			temp_r31->unk40.a = 0;
		}
		return;
	}
	temp_r31 = particle->unk_48;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk00_s16 == 0 || temp_r31->unk00_s16 != 1) {
			continue;
		}
		temp_r31->unk02++;
		temp_f31 = temp_r31->unk02-10.2f;
		if(temp_f31 < 0.0f) {
			temp_r31->unk34.x += (temp_r31->unk08.x-temp_r31->unk34.x)*0.2f;
			temp_r31->unk34.y += (temp_r31->unk08.y-temp_r31->unk34.y)*0.15f;
			temp_r31->unk34.z += (temp_r31->unk08.z-temp_r31->unk34.z)*0.2f;
			temp_r31->unk2C += (temp_r31->unk14.x-temp_r31->unk2C)*0.2f;
			temp_r31->unk14.y += (temp_r31->unk14.z-temp_r31->unk14.y)*0.2f;
			temp_r31->unk40.a = temp_r31->unk14.y;
		} else {
			temp_r31->unk34.x += (temp_r31->unk20*1.5f)*(1.0f/60.0f);
			temp_r31->unk34.y += (temp_r31->unk24*1.5f)*(1.0f/60.0f);
			temp_r31->unk34.z += (temp_r31->unk28*1.5f)*(1.0f/60.0f);
			temp_r31->unk2C += (temp_r31->unk14.x*0.01f);
			temp_r31->unk40.a = 0.92f*temp_r31->unk40.a;
		}
	}
	DCStoreRange(particle->unk_48, particle->unk_30*sizeof(HsfanimStruct01));
}

void fn_1_5DCC(s32 arg0, Vec *arg1, u32 arg2)
{
	float temp_f31;
	float temp_f30;
	
	HsfanimStruct01 *temp_r31;
	ParticleData *temp_r29;
	s32 temp_r28;
	temp_r29 = Hu3DData[arg0].unk_120;
	if(temp_r29->unk_00 != 0) {
		temp_r31 = temp_r29->unk_48;
		for(temp_r28=0; temp_r28<temp_r29->unk_30; temp_r28++, temp_r31++) {
			if(temp_r31->unk00_s16) {
				continue;
			}
			temp_r31->unk00 = 1;
			temp_r31->unk02 = 0;
			temp_r31->unk34.x = arg1->x;
			temp_r31->unk34.y = 11990;
			temp_r31->unk34.z = arg1->z;
			temp_f31 = frandmod(1000)*(1.0f/1000.0f);
			temp_f30 = frandmod(1000)*(360.0f/1000.0f);
			temp_r31->unk20 = 10*(0.8f*(temp_f31*sind(temp_f30)));
			temp_r31->unk24 = 10.0f*(5.0f*(1.0f-(temp_f31*temp_f31)));
			temp_r31->unk28 = 10*(0.8f*(temp_f31*cosd(temp_f30)));
			temp_r31->unk08.x = temp_r31->unk20+arg1->x;
			temp_r31->unk08.y = temp_r31->unk24+temp_r31->unk34.y;
			temp_r31->unk08.z = temp_r31->unk28+arg1->z;
			temp_r31->unk14.x = (6.0f+(0.012f*frandmod(1000)));
			temp_r31->unk2C = 2.0f;
			temp_r31->unk14.y = temp_r31->unk40.a = 10;
			temp_r31->unk14.z = frandmod(100)+64;
			temp_f31 = 0.00040000002f*frandmod(1000);
			temp_f31 += 0.6f*cosd(temp_f30);
			temp_r31->unk40.r = (55*temp_f31)+200;
			temp_r31->unk40.g = (50*temp_f31)+205;
			temp_r31->unk40.b = (5*temp_f31)+250;
			if(--arg2 == 0) {
				break;
			}
		}
	}
}

typedef struct work_61FC {
	s32 unk0;
	s32 unk4;
	u32 unk8;
	float unkC[2];
	s32 unk14;
	s32 unk18;
	s32 unk1C[7];
	float unk38[7];
	s16 unk54[7];
} Work61FC;

void fn_1_6540(omObjData *object);

void fn_1_61FC(omObjData *object)
{
	Work61FC *temp_r31;
	s32 temp_r30;
	s32 temp_r28;
	s32 temp_r26;
	
