Rainchus/marioparty4/src/REL/m408Dll/main.c
	Work61FC *temp_r27;
	
	float sp8[][2] = {
		96, 64,
		486, 64,
		96, 416,
		486, 416
	};
	float sp28[][2] = {
		0, 0,
		0, 0,
		-54, -1,
		2, 1,
		-20, 0,
		42, 2,
		22, 2
	};
	
	object->stat |= 0x100;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, 4*sizeof(Work61FC), MEMORY_DEFAULT_NUM);
	temp_r27 = object->data;
	memset(temp_r27, 0, 4*sizeof(Work61FC));
	temp_r31 = temp_r27;
	for(temp_r28=0; temp_r28<4; temp_r28++, temp_r31++) {
		for(temp_r30=0; temp_r30<7; temp_r30++) {
			temp_r31->unk54[temp_r30] = -1;
			temp_r31->unk38[temp_r30] = 1;
		}
		temp_r31->unkC[0] = sp8[temp_r28][0];
		temp_r31->unkC[1] = sp8[temp_r28][1];
		temp_r26 = espEntry(0x610029, 4, 0);
		temp_r31->unk54[0] = temp_r26;
		espColorSet(temp_r26, 0, 0, 0);
		espTPLvlSet(temp_r26, 0.5);
		temp_r31->unk54[1] = espEntry(0x610028, 3, 0);
		temp_r31->unk54[2] = espEntry(lbl_1_data_0[GWPlayerCfg[temp_r28].character], 2, 0);
		temp_r31->unk54[3] = espEntry(0x27002B, 2, 0);
		temp_r31->unk54[4] = espEntry(0x610008, 2, 0);
		temp_r31->unk54[6] = espEntry(0x610033, 2, 0);
		temp_r31->unk54[5] = espEntry(0x610033, 2, 0);
		for(temp_r30=0; temp_r30<7; temp_r30++) {
			if(temp_r31->unk54[temp_r30] >= 0) {
				espPosSet(temp_r31->unk54[temp_r30], temp_r31->unkC[0]+sp28[temp_r30][0], temp_r31->unkC[1]+sp28[temp_r30][1]);
				espDispOff(temp_r31->unk54[temp_r30]);
			}
		}
		temp_r31->unk0 = 0;
	}
	HuDataDirClose(DATADIR_MGCONST);
	object->func = fn_1_6540;
	(void)temp_r27;
	(void)temp_r27;
}

void fn_1_6540(omObjData *object)
{
	float temp_f31;
	Work61FC *temp_r31;
	s32 temp_r30;
	s32 temp_r29;
	Work61FC *temp_r28 = object->data;
	temp_r31 = temp_r28;
	for(temp_r29=0; temp_r29<4; temp_r29++, temp_r31++) {
		switch(temp_r31->unk14) {
			case 0:
				if(fn_1_6878() == 3) {
					temp_r31->unk14 = 1;
				}
				break;
				
			case 1:
				temp_r31->unk18 = 0;
				temp_r31->unk1C[5] = temp_r31->unk8%10;
				temp_r31->unk1C[6] = (temp_r31->unk8/10)%10;
				for(temp_r30=0; temp_r30<7; temp_r30++) {
					if(temp_r31->unk54[temp_r30] >= 0) {
						espDispOn(temp_r31->unk54[temp_r30]);
					}
				}
				if(temp_r31->unk0) {
					temp_r31->unk38[5] = temp_r31->unk38[6] = 0.5f;
					temp_r31->unk14++;
				} else {
					temp_r31->unk0 = 1;
					temp_r31->unk38[5] = temp_r31->unk38[6] = 1.0f;
					temp_r31->unk14 += 3;
					break;
				}
				
			case 2:
				temp_f31 = temp_r31->unk38[5];
				temp_f31 += 0.10000001f;
				if(temp_f31 >= 1.5f) {
					temp_r31->unk14++;
				}
				temp_r31->unk38[5] = temp_r31->unk38[6] = temp_f31;
				break;
				
			case 3:
				temp_f31 = temp_r31->unk38[5];
				temp_f31 -= 0.10000001f;
				if(temp_f31 <= 1.0f) {
					temp_f31 = 1.0f;
					temp_r31->unk14++;
				}
				temp_r31->unk38[5] = temp_r31->unk38[6] = temp_f31;
				break;
				
			default:
				break;
		}
		temp_r31->unk18++;
		for(temp_r30=0; temp_r30<7; temp_r30++) {
			espBankSet(temp_r31->unk54[temp_r30], temp_r31->unk1C[temp_r30]);
			espScaleSet(temp_r31->unk54[temp_r30], temp_r31->unk38[temp_r30], temp_r31->unk38[temp_r30]);
		}
	}
}

void fn_1_67C4(u16 arg0, u16 arg1)
{
	Work61FC *temp_r31;
	temp_r31 = lbl_1_bss_8->data;
	if(fn_1_6878() == 3) {
		temp_r31[arg0].unk4 += arg1;
		temp_r31[arg0].unk8 += arg1;
		temp_r31[arg0].unk14 = 1;
	}
}

u32 fn_1_6868(void)
{
	return lbl_1_bss_62;
}


u32 fn_1_6878(void)
{
	return lbl_1_bss_60;
}

float fn_1_6888(void)
{
	return lbl_1_bss_54;
}

void fn_1_6898(void)
{
	
}

s32 fn_1_689C(void)
{
	return 0;
}

void fn_1_68A4(void)
{
	
}

Work2FAC *fn_1_68A8(s32 arg0)
{
	return lbl_1_bss_6C[arg0]->data;
}

float fn_1_68C4(float arg8, float arg9, float argA, float argB, float argC, float argD, float argE, float argF, float arg2, float arg3)
{
	float temp_f30;
	float sp14;
	float temp_f29;
	float temp_f28;
	
	
	float temp_f27;
	float temp_f26;
	
	float sp10;
	
	sp14 = (argC + arg3) * (argC + arg3);
	temp_f27 = (arg2 * arg2) + (((argB * argB) + ((argF * argF) + ((argA * argA) - (2.0f * argA * argF)))) - (2.0f * argB * arg2));
	temp_f26 = 2.0f * ((argE * arg2) + ((((arg9 * argB) + ((argD * argF) + (((arg8 * argA) - (arg8 * argF)) - (argD * argA)))) - (arg9 * arg2)) - (argE * argB)));
	sp10 = ((argE * argE) + (((arg9 * arg9) + ((argD * argD) + ((arg8 * arg8) - (2.0f * arg8 * argD)))) - (2.0f * arg9 * argE))) - sp14;
	if(0.0f == temp_f27) {
		return -1;
	}
	temp_f30 = (temp_f26 * temp_f26) - (4.0f * temp_f27 * sp10);
	if(temp_f30 <= 0.0) {
		return -1;
	}
	temp_f30 = sqrtf(temp_f30);
	temp_f29 = (-temp_f26 + temp_f30) / (2.0f * temp_f27);
    temp_f28 = (-temp_f26 - temp_f30) / (2.0f * temp_f27);
	if(temp_f29 >= 0.0f && temp_f28 >= 0.0f) {
		if(temp_f29 < temp_f28) {
			if(temp_f29 < 1.0f) {
				return temp_f29;
			}
		}
		if(temp_f28 < 1.0f) {
			return temp_f28;
		}
	}
	return -1;
}

void fn_1_6C28(float *arg0, float arg1, float arg2, float arg3, float arg4, float arg5, float arg6)
{
	float temp_f24;
	float temp_f29;
	float temp_f28;
	float temp_f31;
	float temp_f30;
	
	float temp_f25;
	
	temp_f29 = arg3;
	temp_f28 = arg4;
	temp_f24 = sqrtf((temp_f29*temp_f29)+(temp_f28*temp_f28));
	if(temp_f24 != 0.0) {
		temp_f25 = 1.0f/temp_f24;
		temp_f29 *= temp_f25;
		temp_f28 *= temp_f25;
	}
	temp_f31 = arg5-arg1;
	temp_f30 = arg6-arg2;
	temp_f25 = 1.0f/sqrtf((temp_f31*temp_f31)+(temp_f30*temp_f30));
	temp_f31 *= temp_f25;
	temp_f30 *= temp_f25;
	temp_f25 = (temp_f29*temp_f31)+(temp_f28*temp_f30);
	arg0[0] = temp_f25*(temp_f31*temp_f24);
	arg0[1] = temp_f25*(temp_f30*temp_f24);
}

void fn_1_6F4C(float arg8, float arg9, float argA, float argB, float argC, float argD, float argE, float argF, float *arg0, float *arg1, float *arg2, float *arg3)
{
	float sp70[2];
	float sp68[2];
	float sp64;
	float sp60;
	sp64 = arg8+(0.5f*(argC-arg8));
	sp60 = arg9+(0.5f*(argD-arg9));
	fn_1_6C28(sp70, arg8, arg9, argA, argB, sp64, sp60);
	fn_1_6C28(sp68, argC, argD, argE, argF, sp64, sp60);
	*arg0 = sp68[0]-sp70[0];
	*arg1 = sp68[1]-sp70[1];
	*arg2 = sp70[0]-sp68[0];
	*arg3 = sp70[1]-sp68[1];
}

void fn_1_75B8(float *arg0, float *arg1, float arg2, float arg3, float arg4, float arg5, float arg6, float arg7)
{
	float temp_f26 = arg2+(0.5f*(arg6-arg2));
	float temp_f25 = arg3+(0.5f*(arg7-arg3));
	float temp_f31 = arg2-temp_f26;
	float temp_f30 = arg3-temp_f25;
	float temp_f28;
	if(temp_f31 == 0.0f || temp_f30 == 0.0f) {
		*arg0 = *arg1 = 0.0f;
		return;
	}
	temp_f28 = 1.0f/sqrtf((temp_f31*temp_f31)+(temp_f30*temp_f30));
	temp_f31 *= temp_f28;
	temp_f30 *= temp_f28;
	*arg0 = (2.0f*temp_f31)*((-arg4*temp_f31)-(arg5*temp_f30));
	*arg1 = (2.0f*temp_f30)*((-arg4*temp_f31)-(arg5*temp_f30));
}

void fn_1_7818(omObjData *arg0, omObjData *arg1)
{
	Work2FAC *temp_r31 = arg0->data;
	Work2FAC *temp_r30 = arg1->data;
	
