Rainchus/marioparty4/src/REL/m408Dll/main.c
	float sp14;
	float sp10;
	float spC;
	float sp8;
	fn_1_6F4C(temp_r31->unk1C.x, temp_r31->unk1C.z, temp_r31->unk34.x, temp_r31->unk34.z, 
		temp_r30->unk1C.x, temp_r30->unk1C.z, temp_r30->unk34.x, temp_r30->unk34.z,
		&sp14, &sp10, &spC, &sp8);
	temp_r31->unk34.x += sp14;
	temp_r31->unk34.z += sp10;
	temp_r30->unk34.x += spC;
	temp_r30->unk34.z += sp8;
}

s32 fn_1_78D8(void)
{
	float temp_f29;
	float temp_f18;
	
	Work2FAC *temp_r31;
	s32 temp_r30;
	Work2FAC *temp_r29;
	Work2FAC *temp_r28;
	s32 temp_r27;
	s32 temp_r26;
	omObjData *temp_r25;
	omObjData *temp_r24;
	omObjData *temp_r23;
	
	omObjData *sp30[2];
	temp_r26 = -1;
	temp_f18 = 0;
	temp_f29 = 9999;
	for(temp_r27=0; temp_r27<3; temp_r27++) {
		temp_r25 = lbl_1_bss_6C[temp_r27];
		temp_r29 = temp_r25->data;
		if(temp_r29->unk4 & 0x10) {
			continue;
		}
		for(temp_r30=temp_r27+1; temp_r30<4; temp_r30++) {
			temp_r24 = lbl_1_bss_6C[temp_r30];
			temp_r28 = temp_r24->data;
			if(temp_r28->unk4 & 0x10) {
				continue;
			}
			temp_f18 = fn_1_68C4(temp_r29->unk1C.x, temp_r29->unk1C.z, temp_r29->unk34.x*lbl_1_bss_4, temp_r29->unk34.z*lbl_1_bss_4,
				temp_r29->unk58.z, temp_r28->unk1C.x, temp_r28->unk1C.z, temp_r28->unk34.x*lbl_1_bss_4, temp_r28->unk34.z*lbl_1_bss_4,
				temp_r28->unk58.z);
			if(temp_f18 >= 0.0 && temp_f18 <= temp_f29) {
				temp_f29 = temp_f18;
				temp_r26 = 1;
				sp30[0] = temp_r25;
				sp30[1] = temp_r24;
			}
		}
	}
	if(temp_r26 < 0) {
		return 0;
	}
	if(temp_f29 > 0.0f) {
		for(temp_r30=0; temp_r30<4; temp_r30++) {
			temp_r31 = lbl_1_bss_6C[temp_r30]->data;
			temp_r31->unk64 = 0;
		}
	}
	for(temp_r30=0; temp_r30<4; temp_r30++) {
		temp_r23 = lbl_1_bss_6C[temp_r30];
		temp_r31 = temp_r23->data;
		if(!(temp_r31->unk4 & 0x10)) {
			temp_r31->unk1C.x += lbl_1_bss_4*(temp_r31->unk34.x*temp_f29);
			temp_r31->unk1C.z += lbl_1_bss_4*(temp_r31->unk34.z*temp_f29);
		}
	}
	if(temp_r26 != 1) {
		(void)temp_r26;
	} else {
		fn_1_7818(sp30[0], sp30[1]);
		for(temp_r30=0; temp_r30<2; temp_r30++) {
			temp_r31 = sp30[temp_r30]->data;
			if(temp_r31->unk4 & 0x10) {
				continue;
			}
			temp_r31->unk64++;
			if(temp_r31->unk18 == 0) {
				lbl_1_bss_0 = 1;
			}
			temp_r31->unk18 = 18;
			if(temp_r31->unk64 > 2.0f) {
				temp_r31->unk34.x = temp_r31->unk34.z  = 0;
			}
		}
	}
	lbl_1_bss_4 *= (1.0f-temp_f29);
	return 1;
}

void fn_1_8020(void)
{
	Work2FAC *temp_r31;
	s32 temp_r30;
	omObjData *temp_r29;
	lbl_1_bss_4 = 1.0f;
	lbl_1_bss_0 = 0;
	while(fn_1_78D8());
	if(lbl_1_bss_0) {
		HuAudFXPlay(1359);
	}
	for(temp_r30=0; temp_r30<4; temp_r30++) {
		temp_r29 = lbl_1_bss_6C[temp_r30];
		temp_r31 = temp_r29->data;
		if(temp_r31->unk18 != 0) {
			temp_r31->unk18--;
		}
		if(temp_r31->unk4 & 0x10) {
			continue;
		}
		temp_r31->unk1C.x += temp_r31->unk34.x*lbl_1_bss_4;
		temp_r31->unk1C.z += temp_r31->unk34.z*lbl_1_bss_4;
		temp_r31->unk28.x = temp_r31->unk34.x*60.0f;
		temp_r31->unk28.z = temp_r31->unk34.z*60.0f;
		temp_r31->unk34.x =  temp_r31->unk34.z = 0;
	}
}

void fn_1_817C(Vec *arg0, Vec *arg1)
{
	Vec sp10;
	sp10.x = arg1->x-arg0->x;
	sp10.y = arg1->y-arg0->y;
	sp10.z = arg1->z-arg0->z;
	Center.x = arg1->x;
	Center.y = arg1->y;
	Center.z = arg1->z;
	CRot.x = atan2d(sp10.y, VECMagXZ(&sp10));
	CRot.y = atan2d(-sp10.x, -sp10.z);
	CRot.z = 0;
	CZoom = sqrtf(VECMag2Point(&sp10));
}

void fn_1_84C4(float arg0, float arg1, float arg2, float arg3, float arg4, float arg5)
{
	Vec sp40;
	Vec sp34;
	sp40.x = arg0;
	sp40.y = arg1;
	sp40.z = arg2;
	sp34.x = arg3;
	sp34.y = arg4;
	sp34.z = arg5;
	fn_1_817C(&sp40, &sp34);
}

float fn_1_883C(float arg0, float arg1, float arg2)
{
	float temp_f31;
	temp_f31 = fmodf(arg1-arg0, 360);
	if(temp_f31 < 0.0f) {
		temp_f31 += 360.0f;
	}
	if(temp_f31 > 180.0f) {
		temp_f31 -= 360.0f;
	}
	temp_f31 = fmodf((arg2*temp_f31)+arg0, 360);
	if(temp_f31 < 0.0f) {
		temp_f31 += 360.0f;
	}
	return temp_f31;
}
